cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
brew 'emacs'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'

# Development
brew 'carthage'
cask 'fastlane'

# Security
#cask '1password'
cask 'avast'
# Communication
#cask 'adium'
cask 'skype'
cask 'slack'
# Browsers
cask 'firefox'
cask 'google-chrome'
# Productivity
#cask 'libreoffice'
cask 'synology-cloud-station-drive'
cask 'handbrake'
cask 'seashore'
# Entertainment
cask 'spotify'
cask 'steam'
cask 'vlc'
# Dev stuff
cask 'atom'
cask 'dash'
cask 'iterm2'
cask 'sourcetree'
cask 'virtualbox'
# Misc
cask 'transmission'
#cask 'tunnelbear'
